html/scheme/syntax_rule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Syntax宏</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">Syntax宏</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4b1aac8">简单宏</a>
<ul>
<li><a href="#org15349c7">多种模式</a></li>
<li><a href="#org79d17a5">递归定义</a></li>
<li><a href="#orged9862e">保留关键字</a></li>
<li><a href="#org2dc4a62">局部宏</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<span class="underline">宏</span> 是 <b>用户自定义的语法</b> ，而Lisp/Scheme 提供的宏远比其他编程语言要强大的多。 使用宏可以让代码漂亮和紧凑
</p>

<p>
本质上来说宏就是一种 <b>代码转换器</b> : 代码在被解释或编译前被转换成另外一种形式去执行
</p>

<p>
在 Scheme 语言中， 在 <span class="underline">R5R5</span> 规范以后简单的宏可以被方便地使用 <span class="underline">syntax-rules</span> 形式来定义，作为对比 Common Lisp 的宏显得要复杂许多：
</p>
<ul class="org-ul">
<li>使用 <span class="underline">syntax-rules</span> 可以更 <b>直接</b> 地定义宏，而不需要考虑诸如 <span class="underline">变量捕捉</span> 等细节</li>
<li>定义复杂的宏，使用 syntax-rules 比起 Common Lisp 的宏来说会困难得多（某些 Scheme 实现提供了 <span class="underline">define-macro</span> ）</li>
</ul>

<div id="outline-container-org4b1aac8" class="outline-2">
<h2 id="org4b1aac8">简单宏</h2>
<div class="outline-text-2" id="text-org4b1aac8">
<p>
把某个变量赋值为 <span class="underline">'()</span>  
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define-syntax</span> <span style="color: #4eee94;">nil!</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">syntax-rules</span> <span style="color: #696969;">()</span>
    <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#36716;&#25442;&#21069;&#21644;&#36716;&#25442;&#21518;&#30340;&#21015;&#34920;</span>
    <span style="color: #696969;">((</span>_ x<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#36716;&#25442;&#21069;&#30340;&#20195;&#30721;&#65292;_ &#34920;&#31034; &#23439;&#30340;&#21517;&#23383;</span>
     <span style="color: #696969;">(</span>set! x '<span style="color: #696969;">()))))</span> <span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">&#36716;&#25442;&#21518;&#30340;&#20195;&#30721;</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define a 1)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">a ; =&gt; 1</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(nil! a)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">a ; =&gt; () </span>
</pre>
</div>

<p>
<span class="underline">syntax-rules</span> 的 <span class="underline">第二个参数</span> 是一个两个元素的 <span class="underline">列表</span> ：
</p>
<ol class="org-ol">
<li>第一个元素：转换前的代码，其中 <span class="underline">_</span> 代表宏的名字</li>
<li>第二个元素：转换后的代码</li>
</ol>

<p>
注意：如果把上面的代码可以写成函数，但是因为闭包的原因，传递进去的参数实际上是不会改变的
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">f-nil!</span> x<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>set! x '<span style="color: #696969;">()))</span> 

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(define a 1)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">a ; =&gt; 1</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(f-nil! a) ; =&gt; () </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">a ; =&gt; 1</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(set! a '())</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">a ; =&gt; () </span>
</pre>
</div>

<p>
当谓词为真的时候，对接下来的表达式求值：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define-syntax</span> <span style="color: #4eee94;">when</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">syntax-rules</span> <span style="color: #696969;">()</span>
    <span style="color: #696969;">((</span>_ pred b1 ...<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">... &#21547;&#20041;&#26159;&#20219;&#24847;&#20010;&#34920;&#36798;&#24335;&#65292;&#21487;&#20197;&#26159;0&#20010;</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> pred <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">begin</span> b1 ...<span style="color: #696969;">)))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(let ((i 0))</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(when (= i 0)</span>
<span style="color: #5f9ea0; font-style: italic;">;;     </span><span style="color: #5f9ea0; font-style: italic;">(display "i == 0")</span>
<span style="color: #5f9ea0; font-style: italic;">;;     </span><span style="color: #5f9ea0; font-style: italic;">(newline)))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; i == 0</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">;Unspecified return value</span>
</pre>
</div>

<pre class="example">
  上面的代码无法用函数来写，因为这是把代码转换到另外一种形式
</pre>

<p>
可以用定义好的宏来再次定义宏：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">while&#23439;&#65306;&#34920;&#31034;&#26465;&#20214;&#25104;&#31435;&#30340;&#24490;&#29615; ;;</span>
<span style="color: #5f9ea0; font-style: italic;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define-syntax</span> <span style="color: #4eee94;">while</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">syntax-rules</span> <span style="color: #696969;">()</span>
    <span style="color: #696969;">((</span>_ pred b1 ...<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">()</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">when</span> pred b1 ... <span style="color: #696969;">(</span>loop<span style="color: #696969;">))))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(let ((i 0))</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(while (&lt; i 10)</span>
<span style="color: #5f9ea0; font-style: italic;">;;     </span><span style="color: #5f9ea0; font-style: italic;">(display i)</span>
<span style="color: #5f9ea0; font-style: italic;">;;     </span><span style="color: #5f9ea0; font-style: italic;">(display #\Space)</span>
<span style="color: #5f9ea0; font-style: italic;">;;     </span><span style="color: #5f9ea0; font-style: italic;">(set! i (+ i 1))))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 0 1 2 3 4 5 6 7 8 9 </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">;Unspecified return value</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">for&#23439;&#65306;&#34920;&#31034;&#25968;&#23383;&#22312;&#33539;&#22260;&#20043;&#20869;&#30340;&#24490;&#29615; ;;</span>
<span style="color: #5f9ea0; font-style: italic;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define-syntax</span> <span style="color: #4eee94;">for</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">syntax-rules</span> <span style="color: #696969;">()</span>
    <span style="color: #696969;">((</span>_ <span style="color: #696969;">(</span>i from to<span style="color: #696969;">)</span> b1 ...<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span><span style="color: #696969;">((</span>i from<span style="color: #696969;">))</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">when</span> <span style="color: #696969;">(</span>&lt; i to<span style="color: #696969;">)</span>
          b1 ...
          <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>1+ i<span style="color: #696969;">)))))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(for (i 0 10)</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(display i)</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(display #\Space))</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 0 1 2 3 4 5 6 7 8 9 </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">;Unspecified return value</span>
</pre>
</div>
</div>

<div id="outline-container-org15349c7" class="outline-3">
<h3 id="org15349c7">多种模式</h3>
<div class="outline-text-3" id="text-org15349c7">
<p>
<span class="underline">syntax-rules</span> 可以支持定义多种模式。incf宏是增加变量的值，如果不传入增加的值，就默认增加 1, 如果给定，就增加给定的值：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">incf&#23439;</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define-syntax</span> <span style="color: #4eee94;">incf</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">syntax-rules</span> <span style="color: #696969;">()</span>
    <span style="color: #696969;">((</span>_ x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">begin</span> <span style="color: #696969;">(</span>set! x <span style="color: #696969;">(</span>+ x 1<span style="color: #696969;">))</span> x<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">&#22914;&#26524;&#19981;&#32473;&#22686;&#21152;&#21442;&#25968;&#65292;&#40664;&#35748;&#22686;&#21152;1</span>
    <span style="color: #696969;">((</span>_ x i<span style="color: #696969;">)</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">begin</span> <span style="color: #696969;">(</span>set! x <span style="color: #696969;">(</span>+ x i<span style="color: #696969;">))</span> x<span style="color: #696969;">))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(let ((i 0) (j 0))</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(incf i)</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(incf j 3)</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(display (list 'i '= i))</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(newline)</span>
<span style="color: #5f9ea0; font-style: italic;">;;   </span><span style="color: #5f9ea0; font-style: italic;">(display (list 'j '= j)))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (i = 1)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(j = 3)</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">;Unspecified return value</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org79d17a5" class="outline-3">
<h3 id="org79d17a5">递归定义</h3>
<div class="outline-text-3" id="text-org79d17a5">
<p>
syntax-rules 支持递归定义宏：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define-syntax</span> <span style="color: #4eee94;">my-and</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">syntax-rules</span> <span style="color: #696969;">()</span>
    <span style="color: #696969;">((</span>_<span style="color: #696969;">)</span> #t<span style="color: #696969;">)</span>
    <span style="color: #696969;">((</span>_ e<span style="color: #696969;">)</span> e<span style="color: #696969;">)</span>
    <span style="color: #696969;">((</span>_ e1 e2 ...<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> e1
         <span style="color: #696969;">(</span>my-and e2 ...<span style="color: #696969;">)</span>
         #f<span style="color: #696969;">))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-and) ; =&gt; #t </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-and #f) ; =&gt; #f </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-and (&gt; 2 1)) ; =&gt; #t</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-and #t #f) ; =&gt; #f</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-and #t (&gt; 2 1)) ; =&gt; #t</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-and #t (&gt; 2 1) (&lt; 3 2) (= 1 1))</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define-syntax</span> <span style="color: #4eee94;">my-or</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">syntax-rules</span> <span style="color: #696969;">()</span>
    <span style="color: #696969;">((</span>_<span style="color: #696969;">)</span> #f<span style="color: #696969;">)</span>
    <span style="color: #696969;">((</span>_ e<span style="color: #696969;">)</span> e<span style="color: #696969;">)</span>
    <span style="color: #696969;">((</span>_ e1 e2 ...<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>t e1<span style="color: #696969;">))</span>
       <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> t t <span style="color: #696969;">(</span>my-or e2 ...<span style="color: #696969;">))))))</span> 

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-or) ; =&gt; #f </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-or #t) ; =&gt; #t </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-or (&lt; 2 1)) ; =&gt; #f</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-or #f #f) ; =&gt; #f</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-or #f (&gt; 2 1)) ; =&gt; #t</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-or #f (&gt; 2 1) (&lt; 3 2) (= 1 1)) ; =&gt; #t </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orged9862e" class="outline-3">
<h3 id="orged9862e">保留关键字</h3>
<div class="outline-text-3" id="text-orged9862e">
<p>
<span class="underline">syntax-rules</span> 的第一个参数是一组 <span class="underline">保留关键字</span> 的列表，这些关键字在转换的时候不会被替换。下面是自定义的 <span class="underline">my-cond</span> 宏， <span class="underline">else</span> 就是这个宏的保留关键字：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define-syntax</span> <span style="color: #4eee94;">my-cond</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">syntax-rules</span> <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span><span style="color: #696969;">)</span>
    <span style="color: #696969;">((</span>_ <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">else</span> e1 ...<span style="color: #696969;">))</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">begin</span> e1 ...<span style="color: #696969;">))</span>
    <span style="color: #696969;">((</span>_ <span style="color: #696969;">(</span>e1 e2 ...<span style="color: #696969;">))</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">when</span> e1 e2 ...<span style="color: #696969;">))</span>
    <span style="color: #696969;">((</span>_ <span style="color: #696969;">(</span>e1 e2 ...<span style="color: #696969;">)</span> c1 ...<span style="color: #696969;">)</span>
     <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> e1 
         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">begin</span> e2 ...<span style="color: #696969;">)</span>
         <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">cond</span> c1 ...<span style="color: #696969;">)))))</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-cond (else (+ 1 2))) ; =&gt; 3</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-cond ((&gt; 1 0) (+ 1 2))) ; =&gt; 3</span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-cond ((&lt; 1 0) (+ 1 2))) ; =&gt; ;Unspecified return value</span>

<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-cond ((&lt; 1 0) (+ 1 2))</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">((&gt; 1 0) (+ 2 3))) ; =&gt; 5 </span>
<span style="color: #5f9ea0; font-style: italic;">;; </span><span style="color: #5f9ea0; font-style: italic;">(my-cond ((&lt; 1 0) (+ 1 2))</span>
<span style="color: #5f9ea0; font-style: italic;">;;       </span><span style="color: #5f9ea0; font-style: italic;">(else (+ 2 3))) ; =&gt; 5 </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2dc4a62" class="outline-3">
<h3 id="org2dc4a62">局部宏</h3>
<div class="outline-text-3" id="text-org2dc4a62">
<p>
<span class="underline">let-syntax</span> 和 <span class="underline">letrec-syntax</span> 可以被用来定义函数中的 <b>局部宏</b> 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
